package by.it.group510901.dremluk.lesson06;

import java.io.FileNotFoundException;
import java.io.InputStream;
import java.util.Scanner;

/*
Задача на программирование: наибольшая кратная подпоследовательность

Дано:
    целое число 1≤n≤1000
    массив A[1…n] натуральных чисел, не превосходящих 2E9.

Необходимо:
    Выведите максимальное 1<=k<=n, для которого гарантированно найдётся
    подпоследовательность индексов i[1]<i[2]<…<i[k] <= длины k,
    для которой каждый элемент A[i[k]] делится на предыдущий
    т.е. для всех 1<=j<k, A[i[j+1]] делится на A[i[j]].

Решить задачу МЕТОДАМИ ДИНАМИЧЕСКОГО ПРОГРАММИРОВАНИЯ

    Sample Input:
    4
    3 6 7 12

    Sample Output:
    3
*/

public class B_LongDivComSubSeq {

    public static void main(String[] args) throws FileNotFoundException {
        // Читаем входные данные из файла dataB.txt
        InputStream stream = B_LongDivComSubSeq.class.getResourceAsStream("dataB.txt");
        B_LongDivComSubSeq instance = new B_LongDivComSubSeq();
        // Вычисляем длину НКП (наибольшей кратной подпоследовательности)
        int result = instance.getDivSeqSize(stream);
        System.out.print(result);
    }
/*суть та же, что в А, но числа в массиве должны быть
отсортированы по принципу целого деления на предыдущее число*/
    int getDivSeqSize(InputStream stream) throws FileNotFoundException {
        // Подготовка к чтению данных
        Scanner scanner = new Scanner(stream);
        //!!!!!!!!!!!!!!!!!!!!!!!!!     НАЧАЛО ЗАДАЧИ     !!!!!!!!!!!!!!!!!!!!!!!!!

        // 1. Считываем размер последовательности
        int n = scanner.nextInt();
        int[] m = new int[n]; /*, суть задачи в том, что программа должна
         вывести максимальную длину массива*/

        // 2. Заполняем массив числами
        for (int i = 0; i < n; i++) {
            m[i] = scanner.nextInt();
        }

        // 3. Реализация динамического программирования
        int result = 0;

        // dp[i] - длина НАИБОЛЬШЕЙ кратной подпоследовательности,
        // которая заканчивается элементом m[i]
        // Ключевое условие: каждый следующий элемент ДЕЛИТСЯ на предыдущий
        int[] dp = new int[n];

        // 4. Основной цикл: заполняем dp[i] для всех элементов
        for (int i = 0; i < n; i++) {
            // Каждый элемент сам по себе - подпоследовательность длины 1
            dp[i] = 1;

            // Просматриваем все предыдущие элементы (индексы j < i)
            for (int j = 0; j < i; j++) {
                // Главное отличие от задачи A_LIS (возрастающая подпоследовательность):
                // Здесь условие НЕ "m[j] < m[i]", а "m[i] % m[j] == 0"
                // То есть m[i] должен НАЦЕЛО делиться на m[j]
                if (m[i] % m[j] == 0) {
                    // Если делится, то можем продлить подпоследовательность,
                    // заканчивающуюся на m[j], добавив m[i] в конец
                    // Новая длина = dp[j] + 1
                    dp[i] = Math.max(dp[i], dp[j] + 1);
                }
            }

            // Обновляем глобальный максимум (длину НКП во всей последовательности)
            result = Math.max(result, dp[i]);
        }

        // Пример работы для Sample Input:
        // Массив: [3, 6, 7, 12]
        //
        // i=0 (3): dp[0]=1
        // i=1 (6): проверяем j=0 → 6%3==0 → dp[1]=max(1, 1+1)=2
        // i=2 (7): проверяем j=0 → 7%3!=0; j=1 → 7%6!=0 → dp[2]=1
        // i=3 (12): проверяем j=0 → 12%3==0 → dp[3]=max(1, 1+1)=2
        //           j=1 → 12%6==0 → dp[3]=max(2, 2+1)=3
        //           j=2 → 12%7!=0
        //
        // dp = [1, 2, 1, 3]
        // result = 3 (подпоследовательность [3, 6, 12])

        //!!!!!!!!!!!!!!!!!!!!!!!!!     КОНЕЦ ЗАДАЧИ     !!!!!!!!!!!!!!!!!!!!!!!!!
        return result;
    }
}